Revit 2027 API
IExternalServer Interface
 The base interface for all external servers.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public interface IExternalServer
Public Interface IExternalServer
public interface class IExternalServer
type IExternalServer = interface end
The IExternalServer type exposes the following members.
Methods
Name | Description
GetDescription |  Implement this method to return a description of the server.
GetName |  Implement this method to return the name of the server.
GetServerId |  Implement this method to return the id of the server.
GetServiceId |  Implement this method to return the id of the service.
GetVendorId |  Implement this method to return the id of the vendor of the server.
Top
Remarks
 Every external service in Revit declares a specific interface for its servers. Each interface must be derived from this IExternalServer. Providers of external servers implement the server interfaces defined by the respective external services to which the servers belong. The whole process of creating a server and registering it with Revit as a server of a concrete external service can be outlined in the following steps:
A provider of an external service declares a server interface derived from IExternalServer
The provider of the service will make it known that this interface is for the servers of that service
An application wanting to have a server will implement the appropriate interface
The server's application obtains the service from Revit using the ExternalServiceRegistry.GetService method
An instance of the server class can then be registered with Revit by using the ExternalService.AddServer method
See Also
Reference
Autodesk.Revit.DB.ExternalService Namespace